# RSM 2401 Group Assignment 1

## Team 3 - JMEX

**Elaine Zhu, Mostapha Haidar, Juile Bai, Xavier Ding**

*Deliverables (to be submitted on Quercus):
All SQL source code / answers in a Jupyter Notebook (*.ipynb).
Based on the Premier Products database that we created in class, answer the following questions using SQL commands. State these questions in markdown cells in your Jupyter notebook and fill in the answer in between.*

In [1]:
# preparation

# install SQL module
#!pip install ipython-sql

In [2]:
# Loading the SQL module
%load_ext sql

In [3]:
# Connect to a SQLite database
%sql sqlite://

'Connected: @None'

In [4]:
# Create table REP

In [5]:
%%sql 
CREATE TABLE REP 
(REP_NUM CHAR(2) PRIMARY KEY,
 LAST_NAME CHAR(15) NOT NULL,
 FIRST_NAME CHAR(15) NOT NULL,
 STREET CHAR(15),
 CITY CHAR(15),
 STATE CHAR(2),
 ZIP CHAR(5),
 COMMISSION DECIMAL(7,2),
 RATE DECIMAL(3,2) );

 * sqlite://
Done.

[]

In [6]:
%%sql 
insert into REP VALUES
('20','Kaiser','Valerie', '624 Randall','Grove','FL','33321',20542.50,0.05);
insert into REP VALUES
('35','Hull','Richard','532 Jackson','Sheldon','FL',33553,39216,.07);
insert into REP VALUES
('65','Perez','Juan','1626 Taylor','Fillmore','FL',33553,23487,.05);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [7]:
%%sql
select * from REP

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie', '624 Randall', 'Grove', 'FL', '33321', 20542.5, 0.05),
 ('35', 'Hull', 'Richard', '532 Jackson', 'Sheldon', 'FL', '33553', 39216, 0.07),
 ('65', 'Perez', 'Juan', '1626 Taylor', 'Fillmore', 'FL', '33553', 23487, 0.05)]

In [8]:
# Create table CUSTOMER

In [9]:
%%sql
create table CUSTOMER
(customer_num char(3) primary key,
customer_name char(35) not null,
street char(15),
city char(15),
state char(12),
zip char(5),
balance decimal(8,2),
credit_limit decimal(8,2),
rep_num char(2));

 * sqlite://
Done.

[]

In [10]:
%%sql
INSERT INTO CUSTOMER
VALUES
('148','Al''s Appliance and Sport','2837 Greenway','Fillmore','FL','33336',6550.00,7500.00,'20');
INSERT INTO CUSTOMER
VALUES
('282','Brookings Direct','3827 Devon','Grove','FL','33321',431.50,10000.00,'35');
INSERT INTO CUSTOMER
VALUES
('356','Ferguson''s','382 Wildwood','Northfield','FL','33146',5785.00,7500.00,'65');
INSERT INTO CUSTOMER
VALUES
('408','The Everything Shop','1828 Raven','Crystal','FL','33503',5285.25,5000.00,'35');
INSERT INTO CUSTOMER
VALUES
('462','Bargains Galore','3829 Central','Grove','FL','33321',3412.00,10000.00,'65');
INSERT INTO CUSTOMER
VALUES
('524','Kline''s','838 Ridgeland','Fillmore','FL','33336',12762.00,15000.00,'20');
INSERT INTO CUSTOMER
VALUES
('608','Johnson''s Department Store','372 Oxford','Sheldon','FL','33553',2106.00,10000.00,'65');
INSERT INTO CUSTOMER
VALUES
('687','Lee''s Sport and Appliance','282 Evergreen','Altonville','FL','32543',2851.00,5000.00,'35');
INSERT INTO CUSTOMER
VALUES
('725','Deerfield''s Four Seasons','282 Columbia','Sheldon','FL','33553',248.00,7500.00,'35');
INSERT INTO CUSTOMER
VALUES
('842','All Season','28 Lakeview','Grove','FL','33321',8221.00,7500.00,'20');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [11]:
# Create table ORDERS

In [12]:
%%sql
CREATE TABLE ORDERS
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3));

 * sqlite://
Done.

[]

In [13]:
%%sql
INSERT INTO ORDERS
VALUES
('21608','20-OCT-2010','148');
INSERT INTO ORDERS
VALUES
('21610','20-OCT-2010','356');
INSERT INTO ORDERS
VALUES
('21613','21-OCT-2010','408');
INSERT INTO ORDERS
VALUES
('21614','21-OCT-2010','282');
INSERT INTO ORDERS
VALUES
('21617','23-OCT-2010','608');
INSERT INTO ORDERS
VALUES
('21619','23-OCT-2010','148');
INSERT INTO ORDERS
VALUES
('21623','23-OCT-2010','608');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [14]:
%sql select * from ORDERS

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148'),
 ('21610', '20-OCT-2010', '356'),
 ('21613', '21-OCT-2010', '408'),
 ('21614', '21-OCT-2010', '282'),
 ('21617', '23-OCT-2010', '608'),
 ('21619', '23-OCT-2010', '148'),
 ('21623', '23-OCT-2010', '608')]

In [15]:
# Create table PART

In [16]:
%%sql
CREATE TABLE PART
(PART_NUM CHAR(4) PRIMARY KEY,
DESCRIPTION CHAR(15),
ON_HAND DECIMAL(4,0),
CLASS CHAR(2),
WAREHOUSE CHAR(1),
PRICE DECIMAL(6,2) );

 * sqlite://
Done.

[]

In [17]:
%%sql
INSERT INTO PART VALUES
('AT94','Iron',50,'HW','3',24.95),
('BV06','Home Gym',45,'SG','2',794.95),
('CD52','Microwave Oven',32,'AP','1',165.00),
('DL71','Cordless Drill',21,'HW','3',129.95),
('DR93','Gas Range',8,'AP','2',495.00),
('DW11','Washer',12,'AP','3',399.99),
('FD21','Stand Mixer',22,'HW','3',159.95),
('KL62','Dryer',12,'AP','1',349.95),
('KT03','Dishwasher',8,'AP','3',595.00),
('KV29','Treadmill',9,'SG','2',1390.00);

 * sqlite://
10 rows affected.

[]

In [18]:
# Create table ORDER_LINE

In [19]:
%%sql
CREATE TABLE ORDER_LINE
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (ORDER_NUM, PART_NUM) );

 * sqlite://
Done.

[]

In [20]:
%%sql
INSERT INTO ORDER_LINE VALUES
('21608','AT94',11,21.95),
('21610','DR93',1,495.00),
('21610','DW11',1,399.99),
('21613','KL62',4,329.95),
('21614','KT03',2,595.00),
('21617','BV06',2,794.95),
('21617','CD52',4,150.00),
('21619','DR93',1,495.00),
('21623','KV29',2,1290.00);

 * sqlite://
9 rows affected.

[]

The data should be ready now.

## Part A Warm-up SQL Fundamentals

## A.1. 
*List the names of all customers that have a credit limit of $7,500 or less.*

In [21]:
%%sql
select customer_name from customer where credit_limit <= 7500

 * sqlite://
Done.

[("Al's Appliance and Sport",),
 ("Ferguson's",),
 ('The Everything Shop',),
 ("Lee's Sport and Appliance",),
 ("Deerfield's Four Seasons",),
 ('All Season',)]

## A.2. 
*List the order numbers for orders placed by customer number 608 on 10/23/2010.*

In [22]:
%%sql
select order_num from orders where customer_num = 608 and order_date = '23-OCT-2010'

 * sqlite://
Done.

[('21617',), ('21623',)]

## A.3.
*List the part number and part description of all parts that are in item class HW.*

In [23]:
%%sql
select part_num, description from part where class = 'HW'

 * sqlite://
Done.

[('AT94', 'Iron'), ('DL71', 'Cordless Drill'), ('FD21', 'Stand Mixer')]

## A.4. 
*List the part number, part description, and on-hand value for each part in item class SG. (Hint: On-hand value is the result of multiplying the number of units on hand by the price.)*

In [24]:
%%sql
select part_num, description, (on_hand * price) as ON_HAND_VALUE from part

 * sqlite://
Done.

[('AT94', 'Iron', 1247.5),
 ('BV06', 'Home Gym', 35772.75),
 ('CD52', 'Microwave Oven', 5280),
 ('DL71', 'Cordless Drill', 2728.95),
 ('DR93', 'Gas Range', 3960),
 ('DW11', 'Washer', 4799.88),
 ('FD21', 'Stand Mixer', 3518.8999999999996),
 ('KL62', 'Dryer', 4199.4),
 ('KT03', 'Dishwasher', 4760),
 ('KV29', 'Treadmill', 12510)]

## A.5. 
*How many customers have a balance that exceeds their credit limit?*

In [25]:
%%sql
select count(*) from customer where balance > credit_limit

 * sqlite://
Done.

[(2,)]

## A.6. 
*What is the part number, description, and price of the least expensive part in the database?*

In [26]:
%%sql
select part_num, description, price from part order by price limit 1

 * sqlite://
Done.

[('AT94', 'Iron', 24.95)]

## A.7. 
*For each order, list the order number, order date, customer number, and customer name.*

In [27]:
%%sql
select
order_num, 
order_date, 
customer.customer_num, 
customer.customer_name 
from orders, customer where orders.customer_num = customer.customer_num;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21610', '20-OCT-2010', '356', "Ferguson's"),
 ('21613', '21-OCT-2010', '408', 'The Everything Shop'),
 ('21614', '21-OCT-2010', '282', 'Brookings Direct'),
 ('21617', '23-OCT-2010', '608', "Johnson's Department Store"),
 ('21619', '23-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21623', '23-OCT-2010', '608', "Johnson's Department Store")]

## A.8. 
*For each order placed on October 21, 2010, list the order number, customer number, and customer name.*

In [28]:
%%sql
select 
orders.order_num,
orders.customer_num,
customer.customer_name
from orders, customer 
where orders.customer_num = customer.customer_num
and order_date = '21-OCT-2010'

 * sqlite://
Done.

[('21613', '408', 'The Everything Shop'), ('21614', '282', 'Brookings Direct')]

## A.9. 
*For each order placed on October 21, 2010, list the order number, part number, part description, and item class for each part ordered.*

In [29]:
%%sql
select
orders.order_num,
part.part_num,
part.description as PART_DESCRIPTION,
part.class as ITEM_CLASS
from orders, order_line, part
where orders.order_num = order_line.order_num
and order_line.part_num = part.part_num
and orders.order_date = '21-OCT-2010'

 * sqlite://
Done.

[('21613', 'KL62', 'Dryer', 'AP'), ('21614', 'KT03', 'Dishwasher', 'AP')]

## Part B Database Design

*By writing SQL commands for the necessary changes only (i.e., we assume all other commands are given as in the Premier Products database that we created in class and you only need to create the new/modified tables as discussed below) support the following requirements.
Hint: To avoid conflicts with existing tables, simply number the new tables by appending the question number, e.g., for part 1 of this question name the customer table customer1.*

## B.1. 
*A customer is not necessarily represented by a single sales rep, but can be represented by several sales reps. When a customer places an order, the sales rep who gets the commission on the order must be in the collection of sales reps who represent the customer. Draw an E-R diagram for the new design.*

<img src="E-R_B1.png">

## B.2. 
*There is no relationship between customers and sales reps. When a customer places an order, any sales rep can process the order. On the order, you need to identify both the customer placing the order and the sales rep responsible for the order. Draw an E-R diagram for the new design.*

<img src="E-R_B2.PNG">

## B.3. 

*Using your knowledge of Premiere Products, determine the functional dependencies that exist in the following table. After determining the functional dependencies, convert this table to an equivalent collection of tables that are in third normal form.*

*PART (PART_NUM, DESCRIPTION, ON_HAND, CLASS, WAREHOUSE, PRICE, (ORDER_NUM, ORDER_DATE, CUSTOMER_NUM, CUSTOMER_NAME, NUM_ORDERED, QUOTED_PRICE) ) PART_NUM is the primary key of this table. The highlighted text indicates repeating groups, i.e., each part occurs in “many” orders for which we record the order number, date, customer number and so forth. State the SQL commands that create the collection of tables in 3NF.*

“part_num” functionally determines “description”, “on_hand”, “class”, “warehouse”, “price”.

“order_num” functionally determines  “order_date”, “customer_num”, “customer_name”.

“customer_num” functionally determines “customer_name”.

“order_num” and ”part_num” together functionally determine “number_ordered”, “quoted_price”.

In [30]:
%%sql
CREATE TABLE part3
(part_num char(4) primary key,
description char(15),
on_hand decimal(4,0),
class char(2),
warehouse char(1),
price decimal(6,2));

 * sqlite://
Done.

[]

In [31]:
%%sql
CREATE TABLE order3
(ORDER_NUM CHAR(5) PRIMARY KEY,
ORDER_DATE DATE,
CUSTOMER_NUM CHAR(3));

 * sqlite://
Done.

[]

In [32]:
%%sql
CREATE TABLE customer3
(customer_num char(3) primary key,
customer_name char(15) not null);

 * sqlite://
Done.

[]

In [33]:
%%sql
CREATE TABLE order_line3
(ORDER_NUM CHAR(5),
PART_NUM CHAR(4),
NUM_ORDERED DECIMAL(3,0),
QUOTED_PRICE DECIMAL(6,2),
PRIMARY KEY (ORDER_NUM, PART_NUM));

 * sqlite://
Done.

[]

## Part C Fundamental SQL

## C.1. 

*List the number and name of each customer represented by sales rep 35 or sales rep 65.*

In [34]:
%%sql
SELECT customer_num, customer_name
FROM customer
WHERE rep_num = 35
OR rep_num = 65;

 * sqlite://
Done.

[('282', 'Brookings Direct'),
 ('356', "Ferguson's"),
 ('408', 'The Everything Shop'),
 ('462', 'Bargains Galore'),
 ('608', "Johnson's Department Store"),
 ('687', "Lee's Sport and Appliance"),
 ('725', "Deerfield's Four Seasons")]

## C.2. 
*List the part number and part description of each part that is not in item class AP.*

In [35]:
%%sql
SELECT part_num, description
FROM part
WHERE NOT class = 'AP';

 * sqlite://
Done.

[('AT94', 'Iron'),
 ('BV06', 'Home Gym'),
 ('DL71', 'Cordless Drill'),
 ('FD21', 'Stand Mixer'),
 ('KV29', 'Treadmill')]

## C.3. 
*List the part number, description, and number of units on hand for each part that has between 10 and 25 units on hand, including both 10 and 25. Do this in different two ways.*

### 1st WAY

In [36]:
%%sql 
SELECT part_num, description, on_hand
FROM part
WHERE on_hand BETWEEN 10 AND 25;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21),
 ('DW11', 'Washer', 12),
 ('FD21', 'Stand Mixer', 22),
 ('KL62', 'Dryer', 12)]

## 2nd WAY

In [37]:
%%sql
SELECT part_num, description, on_hand
FROM part
WHERE on_hand <= 25
AND on_hand >= 10;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21),
 ('DW11', 'Washer', 12),
 ('FD21', 'Stand Mixer', 22),
 ('KL62', 'Dryer', 12)]

## C.4. 
*Use the IN operator to list the part number and part description of each part in item class AP or SG.*

In [38]:
%%sql
SELECT part_num, description
FROM part
WHERE CLASS IN ('AP', 'SG');

 * sqlite://
Done.

[('BV06', 'Home Gym'),
 ('CD52', 'Microwave Oven'),
 ('DR93', 'Gas Range'),
 ('DW11', 'Washer'),
 ('KL62', 'Dryer'),
 ('KT03', 'Dishwasher'),
 ('KV29', 'Treadmill')]

## C.5.
*Find the number and name of each customer whose name begins with the letter “B.”*

In [39]:
%%sql 
SELECT customer_num, customer_name
FROM customer
WHERE customer_name LIKE 'B%';

 * sqlite://
Done.

[('282', 'Brookings Direct'), ('462', 'Bargains Galore')]

## C.6. 
*List all details about all parts. Order the output by part description.*

In [40]:
%%sql
SELECT *
FROM part
ORDER BY description;

 * sqlite://
Done.

[('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99)]

## C.7. 
*List all details about all parts. Order the output by part number within warehouse. (That is, order the output by warehouse and then by part number.)*

In [41]:
%%sql
SELECT * 
FROM part
ORDER BY warehouse, part_num;

 * sqlite://
Done.

[('CD52', 'Microwave Oven', 32, 'AP', '1', 165),
 ('KL62', 'Dryer', 12, 'AP', '1', 349.95),
 ('BV06', 'Home Gym', 45, 'SG', '2', 794.95),
 ('DR93', 'Gas Range', 8, 'AP', '2', 495),
 ('KV29', 'Treadmill', 9, 'SG', '2', 1390),
 ('AT94', 'Iron', 50, 'HW', '3', 24.95),
 ('DL71', 'Cordless Drill', 21, 'HW', '3', 129.95),
 ('DW11', 'Washer', 12, 'AP', '3', 399.99),
 ('FD21', 'Stand Mixer', 22, 'HW', '3', 159.95),
 ('KT03', 'Dishwasher', 8, 'AP', '3', 595)]

## C.8. 
*List the part number, part description, and on-hand value of each part whose number of units on hand is more than the average number of units on hand for all parts. (Hint: Use a subquery.)*

In [42]:
%%sql
SELECT part_num, description, on_hand
FROM part
WHERE on_hand > (SELECT AVG(on_hand)
                 FROM part
                );

 * sqlite://
Done.

[('AT94', 'Iron', 50),
 ('BV06', 'Home Gym', 45),
 ('CD52', 'Microwave Oven', 32),
 ('FD21', 'Stand Mixer', 22)]

## C.9. 
*List the sum of the balances of all customers for each sales rep. Order and group the results by sales rep number.*

In [43]:
%%sql
SELECT rep_num, SUM(balance)
FROM customer
GROUP BY (rep_num)
ORDER BY (rep_num);

 * sqlite://
Done.

[('20', 27533), ('35', 8815.75), ('65', 11303)]

## C.10. 
*List the sum of the balances of all customers for each sales rep, but restrict the output to those sales reps for which the sum is more than 10,000. Order the results by sales rep number.*

In [44]:
%%sql
SELECT rep_num, SUM(balance)
FROM customer
              
GROUP BY rep_num
HAVING SUM(balance) > 10000

ORDER BY rep_num;

 * sqlite://
Done.

[('20', 27533), ('65', 11303)]

## C.11. 
*List the part number of any part with an unknown description.*

In [45]:
%%sql
SELECT part_num
FROM part
WHERE description IS NULL;

 * sqlite://
Done.

[]

## Part D More Advance SQL

## D.1. 
*For each order, list the order number and order date along with the number and name of the customer that placed the order.*

In [46]:
%%sql
select order_num, order_date, customer.customer_num, customer.customer_name 
from orders, customer where orders.customer_num = customer.customer_num;

 * sqlite://
Done.

[('21608', '20-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21610', '20-OCT-2010', '356', "Ferguson's"),
 ('21613', '21-OCT-2010', '408', 'The Everything Shop'),
 ('21614', '21-OCT-2010', '282', 'Brookings Direct'),
 ('21617', '23-OCT-2010', '608', "Johnson's Department Store"),
 ('21619', '23-OCT-2010', '148', "Al's Appliance and Sport"),
 ('21623', '23-OCT-2010', '608', "Johnson's Department Store")]

## D.2. 
*For each order placed on October 23, 2010, list the order number along with the number and name of the customer that placed the order.*

In [47]:
%%sql
select order_num, customer.customer_num, customer.customer_name 
from orders, customer where orders.customer_num = customer.customer_num
and order_date = '23-OCT-2010';

 * sqlite://
Done.

[('21617', '608', "Johnson's Department Store"),
 ('21619', '148', "Al's Appliance and Sport"),
 ('21623', '608', "Johnson's Department Store")]

## D.3. 
*For each order, list the order number, order date, part number, number of units ordered, and quoted price for each order line that makes up the order.*

In [48]:
%%sql
select orders.order_num, order_date, order_line.part_num, order_line.num_ordered, order_line.quoted_price
from orders, order_line 
where orders.order_num = order_line.order_num

 * sqlite://
Done.

[('21608', '20-OCT-2010', 'AT94', 11, 21.95),
 ('21610', '20-OCT-2010', 'DR93', 1, 495),
 ('21610', '20-OCT-2010', 'DW11', 1, 399.99),
 ('21613', '21-OCT-2010', 'KL62', 4, 329.95),
 ('21614', '21-OCT-2010', 'KT03', 2, 595),
 ('21617', '23-OCT-2010', 'BV06', 2, 794.95),
 ('21617', '23-OCT-2010', 'CD52', 4, 150),
 ('21619', '23-OCT-2010', 'DR93', 1, 495),
 ('21623', '23-OCT-2010', 'KV29', 2, 1290)]

## D.4. 
*Use the IN operator to find the number and name of each customer that placed an order on October 23, 2010.*

In [49]:
%%sql
select distinct customer.customer_num, customer.customer_name
from orders, customer where orders.customer_num = customer.customer_num
and order_date IN ('23-OCT-2010');

 * sqlite://
Done.

[('608', "Johnson's Department Store"), ('148', "Al's Appliance and Sport")]

## D.5. 
*Repeat Exercise 4, but this time use the EXISTS operator in your answer.*

In [50]:
%%sql
select distinct customer.customer_num, customer.customer_name
from customer where exists (select * from orders where orders.customer_num = customer.customer_num
and order_date = '23-OCT-2010');

 * sqlite://
Done.

[('148', "Al's Appliance and Sport"), ('608', "Johnson's Department Store")]

## D.6. 
*Find the number and name of each customer that did not place an order on October 23, 2010.*

In [51]:
%%sql
select distinct customer.customer_num, customer.customer_name
from customer where not exists (select * from orders where orders.customer_num = customer.customer_num
and order_date = '23-OCT-2010');

 * sqlite://
Done.

[('282', 'Brookings Direct'),
 ('356', "Ferguson's"),
 ('408', 'The Everything Shop'),
 ('462', 'Bargains Galore'),
 ('524', "Kline's"),
 ('687', "Lee's Sport and Appliance"),
 ('725', "Deerfield's Four Seasons"),
 ('842', 'All Season')]

## D.7. 
*For each order, list the order number, order date, part number, part description, and item class for each part that makes up the order.*

In [52]:
%%sql
select order_num, order_date, part.part_num, part.description, part.class from(
select a.order_num, order_date, part_num from 
(select order_num, order_date, orders.customer_num 
 from orders, customer 
 where orders.customer_num = customer.customer_num) as a, order_line
where a.order_num = order_line.order_num) as b, part where b.part_num = part.part_num

 * sqlite://
Done.

[('21608', '20-OCT-2010', 'AT94', 'Iron', 'HW'),
 ('21610', '20-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21610', '20-OCT-2010', 'DW11', 'Washer', 'AP'),
 ('21613', '21-OCT-2010', 'KL62', 'Dryer', 'AP'),
 ('21614', '21-OCT-2010', 'KT03', 'Dishwasher', 'AP'),
 ('21617', '23-OCT-2010', 'BV06', 'Home Gym', 'SG'),
 ('21617', '23-OCT-2010', 'CD52', 'Microwave Oven', 'AP'),
 ('21619', '23-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21623', '23-OCT-2010', 'KV29', 'Treadmill', 'SG')]

## D.8. 
*Repeat Exercise 7, but this time order the rows by item class and then by order number.*

In [53]:
%%sql
select order_num, order_date, part.part_num, part.description, part.class from(
select a.order_num, order_date, part_num from 
(select order_num, order_date, orders.customer_num 
 from orders, customer 
 where orders.customer_num = customer.customer_num) as a, order_line
where a.order_num = order_line.order_num) as b, part where b.part_num = part.part_num
order by class, order_num

 * sqlite://
Done.

[('21610', '20-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21610', '20-OCT-2010', 'DW11', 'Washer', 'AP'),
 ('21613', '21-OCT-2010', 'KL62', 'Dryer', 'AP'),
 ('21614', '21-OCT-2010', 'KT03', 'Dishwasher', 'AP'),
 ('21617', '23-OCT-2010', 'CD52', 'Microwave Oven', 'AP'),
 ('21619', '23-OCT-2010', 'DR93', 'Gas Range', 'AP'),
 ('21608', '20-OCT-2010', 'AT94', 'Iron', 'HW'),
 ('21617', '23-OCT-2010', 'BV06', 'Home Gym', 'SG'),
 ('21623', '23-OCT-2010', 'KV29', 'Treadmill', 'SG')]

## D.9. 
*Use a subquery to find the rep number, last name, and first name of each sales rep who represents at least one customer with a credit limit of $10,000. List each sales rep only once in the results.*

In [54]:
%%sql
select rep_num, last_name, first_name from rep where rep_num in (select rep_num from customer where credit_limit >= 10000)
order by rep_num

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie'),
 ('35', 'Hull', 'Richard'),
 ('65', 'Perez', 'Juan')]

## D.10. 
*Repeat Exercise 9, but this time do not use a subquery.*

In [55]:
%%sql
select distinct rep.rep_num, rep.last_name, rep.first_name from rep, customer
where rep.rep_num = customer.rep_num
and customer.credit_limit >= 10000
order by rep.rep_num

 * sqlite://
Done.

[('20', 'Kaiser', 'Valerie'),
 ('35', 'Hull', 'Richard'),
 ('65', 'Perez', 'Juan')]

## D.11. 
*Find the number and name of each customer that currently has an order on file for a Gas Range.*

In [56]:
%%sql
select orders.customer_num, customer.customer_name from orders, customer where order_num in
(select distinct order_num from order_line, part 
 where order_line.part_num = part.part_num 
 and part.description = 'Gas Range')
and orders.customer_num = customer.customer_num
order by customer.customer_num;

 * sqlite://
Done.

[('148', "Al's Appliance and Sport"), ('356', "Ferguson's")]

## D.12. 
*List the part number, part description, and item class for each pair of parts that are in the same item class. (For example, one such pair would be part AT94 and part FD21, because the item class for both parts is HW.)*

In [57]:
%%sql
select distinct a.part_num as part_num_1, a.description as description_1,
b.part_num as part_num_2, b.description as description_2,
a.class from part a, part b
where a.class = b.class
and a.part_num < b.part_num
order by a.class, a.part_num, b.part_num;

 * sqlite://
Done.

[('CD52', 'Microwave Oven', 'DR93', 'Gas Range', 'AP'),
 ('CD52', 'Microwave Oven', 'DW11', 'Washer', 'AP'),
 ('CD52', 'Microwave Oven', 'KL62', 'Dryer', 'AP'),
 ('CD52', 'Microwave Oven', 'KT03', 'Dishwasher', 'AP'),
 ('DR93', 'Gas Range', 'DW11', 'Washer', 'AP'),
 ('DR93', 'Gas Range', 'KL62', 'Dryer', 'AP'),
 ('DR93', 'Gas Range', 'KT03', 'Dishwasher', 'AP'),
 ('DW11', 'Washer', 'KL62', 'Dryer', 'AP'),
 ('DW11', 'Washer', 'KT03', 'Dishwasher', 'AP'),
 ('KL62', 'Dryer', 'KT03', 'Dishwasher', 'AP'),
 ('AT94', 'Iron', 'DL71', 'Cordless Drill', 'HW'),
 ('AT94', 'Iron', 'FD21', 'Stand Mixer', 'HW'),
 ('DL71', 'Cordless Drill', 'FD21', 'Stand Mixer', 'HW'),
 ('BV06', 'Home Gym', 'KV29', 'Treadmill', 'SG')]

## D.13. 
*List the order number and order date for each order placed by the customer named Johnson’s Department Store. (Hint: To enter an apostrophe (single quotation mark) within a string of characters, type two single quotation marks.)*

In [58]:
%%sql
select order_num, order_date from orders 
where customer_num in 
(select customer_num from customer where customer_name = 'Johnson''s Department Store');

 * sqlite://
Done.

[('21617', '23-OCT-2010'), ('21623', '23-OCT-2010')]

## D.14. 
*List the order number and order date for each order that contains an order line for an Iron.*

In [59]:
%%sql
select order_num, order_date from orders where order_num in (
select order_num from order_line, part 
where order_line.part_num = part.part_num
and part.description = 'Iron');

 * sqlite://
Done.

[('21608', '20-OCT-2010')]

## D.15. 
*List the order number and order date for each order that either was placed by Johnson’s Department Store or that contains an order line for a Gas Range.*

In [60]:
%%sql
select distinct
orders.order_num,
orders.order_date
from orders, order_line, customer, part
where orders.order_num = order_line.order_num 
and orders.customer_num = customer.customer_num
and order_line.part_num = part.part_num
and (part.description = 'Gas Range' or customer.customer_name = 'Johnson''s Department Store')

 * sqlite://
Done.

[('21610', '20-OCT-2010'),
 ('21617', '23-OCT-2010'),
 ('21619', '23-OCT-2010'),
 ('21623', '23-OCT-2010')]

## D.16. 
*List the order number and order date for each order that was placed by Johnson’s Department Store and that contains an order line for a Gas Range.*

In [61]:
%%sql
select 
orders.order_num,
orders.order_date
from orders, order_line, customer, part
where orders.order_num = order_line.order_num 
and orders.customer_num = customer.customer_num
and order_line.part_num = part.part_num
and (part.description = 'Gas Range' and customer.customer_name = 'Johnson''s Department Store')

 * sqlite://
Done.

[]

## D.17. 
*List the order number and order date for each order that was placed by Johnson’s Department Store but that does not contain an order line for a Gas Range.*

In [62]:
%%sql
select distinct
orders.order_num,
orders.order_date
from orders, order_line, customer, part
where orders.order_num = order_line.order_num 
and orders.customer_num = customer.customer_num
and order_line.part_num = part.part_num
and part.description not in ('Gas Range')
and customer.customer_name = 'Johnson''s Department Store';

 * sqlite://
Done.

[('21617', '23-OCT-2010'), ('21623', '23-OCT-2010')]

## D.18. 
*For each part, list the part number, description, units on hand, order number, and number of units ordered. All parts should be included in the results. For those parts that are currently not on order, the order number and number of units ordered should be left blank (None/NULL/NA). Order the results by part number.*

In [63]:
%%sql
select part.part_num, part.description, part.on_hand, order_line.order_num, order_line.num_ordered
from part left join order_line
on part.part_num = order_line.part_num
order by part.part_num

 * sqlite://
Done.

[('AT94', 'Iron', 50, '21608', 11),
 ('BV06', 'Home Gym', 45, '21617', 2),
 ('CD52', 'Microwave Oven', 32, '21617', 4),
 ('DL71', 'Cordless Drill', 21, None, None),
 ('DR93', 'Gas Range', 8, '21610', 1),
 ('DR93', 'Gas Range', 8, '21619', 1),
 ('DW11', 'Washer', 12, '21610', 1),
 ('FD21', 'Stand Mixer', 22, None, None),
 ('KL62', 'Dryer', 12, '21613', 4),
 ('KT03', 'Dishwasher', 8, '21614', 2),
 ('KV29', 'Treadmill', 9, '21623', 2)]